const prefix = {
    "1": "เด็กชาย",
    "2": "เด็กหญิง",
    "3": "นาย",
    "4": "นาง",
    "5": "นางสาว",
    "6": "พระสงฆ์",
    "7": "อื่นๆ",
    "8": "ว่าที่ รต.",
    "9": "ส.อ.",
    "10": "เรือโทหญิง",
    "11": "ว่าที่ รต.หญิง",
}

const education = {
    "1": "ไม่ได้รับการศึกษา/ไม่จบชั้น",
    "2": "ประถมศึกษาตอนต้น",
    "3": "ประถมศึกษาตอนปลาย",
    "4": "มัธยมศึกษาตอนต้น",
    "5": "มัธยมศึกษาตอนปลาย",
    "6": "ปวช.",
    "7": "ปวส./อนุปริญญา",
    "8": "ปริญญาตรี",
    "9": "สูงกว่าปริญญาตรี",
}

const career = {
    "1": "ไม่มีอาชีพ/ว่างงาน",
    "2": "นักเรียน/นักศึกษา",
    "3": "ค้าขาย/ธุรกิจส่วนตัว",
    "4": "ภิกษุ/สามเณร/แม่ชี",
    "5": "เกษตรกร (ทำไร่/นา/สวน/เลี้ยงสัตว์/ประมง)",
    "6": "รับจ้าง",
    "7": "ข้าราชการ/พนักงานของรัฐ",
    "8": "พนักงานรัฐวิสาหกิจ",
    "9": "พนักงานบริษัท",
}

const relation_case = {
    "1": "ตนเอง",
    "2": "บิดา/มารดา",
    "3": "ญาติพี่น้อง ",
    "4": "บุตร ",
    "5": "คู่สมรส",
    "6": "เจ้าหน้าที่จาก อบต. ",
    "15": "ผู้ใหญ่บ้าน ",
    "17": "หลาน",
}

const religion = {
    "1": "พุทธ ",
    "2": "อิสลาม ",
    "3": "คริสต์  ",
    "4": "ไม่มีศาสนา  ",
    "5": "พราหมณ์/ฮินดู ",
    "6": "อื่นๆ",
    "7": "จีน ",
    "8": "ซิกส์",
}

const marital_status = {
    "1": "โสด",
    "2": "สมรสอยู่ด้วยกัน",
    "3": "สมรสแยกกันอยู่ ",
    "4": "อื่นๆ",
    "5": "ไม่สมรสแต่อยู่ด้วยกัน",
    "6": "หม้าย (คู่สมรสเสียชีวิต)",
    "7": "หย่าร้าง",
}

const residence_place = {
    "1": "บ้านตนเอง",
    "2": "อาศัยผู้อื่นอยู่",
    "3": "อาศัยอยู่กับญาติ",
    "4": "บ้านเช่า",
    "5": "อยู่กับผู้จ้าง",
    "6": "ไม่มีที่อยู่เป็นหลักแหล่ง",
}

const five = {
    "Radio5_001" : "ครอบครัวของเด็ก/เด็กที่ประสบปัญหาความเดือดร้อน",
    "Radio5_002" : "ผู้ตกทุกข์ได้ยากที่ขอให้ช่วยเหลือส่งกลับภูมิลำเนาเดิม",
    "Radio5_003" : "ผู้ประสบปัญหาทางสังคมกรณีฉุกเฉิน",
    "Radio5_004" : "ครอบครัวผู้มีรายได้น้อยที่ประสบความเดือดร้อนหรือผู้ไร้ที่พึ่ง",
    "Radio5_005" : "ครอบครัวคนพิการที่มีบัตรประจำตัวคนพิการและประสบปัญหาความเดือดร้อน",
    "Radio5_006" : "สตรีหรือครอบครัวที่ประสบปัญหาทางสังคม",
    "Radio5_007" : "ผู้สูงอายุที่ประสบปัญหาความเดือดร้อนและมีความจำเป็นในเรื่องต่างๆ",
    "Radio5_008" : "ผู้สูงอายุที่ถูกทารุณกรรม หรือถูกแสวงหาประโยชน์โดยมิชอบด้วยกฎหมาย หรือถูกทอดทิ้ง",
    "Radio5_009" : "สตรีที่เป็นหัวหน้าครอบครัวที่ติดเชื้อหรือป่วยด้วยโรคเอดส์และมีผู้อยู่ในอุปการะ",
    "Radio5_010" : "สตรีที่เป็นหัวหน้าครอบครัวที่ไม่ได้ติดเชื้อหรือป่วยด้วยโรคเอดส์ แต่ต้องอุปการะคนในครอบครัวที่ติดเชื้อหรือป่วยด้วยโรคเอดส์",
    "Radio5_011" : "สตรีที่ติดเชื้อหรือป่วยด้วยโรคเอดส์ที่ไม่มีผู้อุปการะเลี้ยงดู",
    "Radio5_012" : "สตรีที่สามีป่วย หรือเสียชีวิตด้วยโรคเอดส์ แต่ต้องอุปการะเลี้ยงดูบุคคลในครอบครัว",
    "Radio5_013" : "ครอบครัวที่เป็นหัวหน้าครอบครัวติดเชื้อ หรือ ป่วยด้วยโรคเอดส์ และมีผู้อยู่ในอุปการะ",
    "Radio5_014" : "ครอบครัวที่เป็นหัวหน้าครอบครัวไม่ได้ติดเชื้อหรือป่วยด้วยโรคเอดส์ แต่ต้องอุปการะสมาชิกในครอบครัวที่ติดเชื้อหรือป่วยด้วยโรคเอดส์",
    "Radio5_015" : "ครอบครัวที่หัวหน้าครอบครัวถึงแก่กรรมด้วยโรคเอดส์",
    "Radio5_016" : "ผู้ติดเชื้อหรือป่วยด้วยโรคเอดส์ที่ไม่มีผู้อุปการะเลี้ยงดู",
    "Radio5_017" : "ราษฎรบนพื้นที่สูงซึ่งเป็นชาวเขาประสบปัญหาความเดือดร้อน",
}

const six = {
    "Radio61_001" : "ไม่มีกรรมสิทธิ์ในที่อยู่อาศัย",
    "Radio61_002" : "สภาพที่อยู่อาศัยไม่เหมาะสมต่อการพักอาศัย",
    "Radio61_003" : "ไม่มีที่อยู่อาศัย",
    "Radio61_004" : "เร่ร่อน",

    "Radio62_001" : "ติดเชื้อเอดส์(HIV)/ป่วยด้วยโรคเอดส์",
    "Radio62_002" : "หลงลืมชราภาพ",
    "Radio62_003" : "ได้รับผลกระทบจากเชื้อเอดส์/ป่วยด้วยโรคเอดส์",
    "Radio62_004" : "ป่วยเป็นโรคร้ายแรง",
    "Radio62_005" : "เจ็บป่วยเรื้อรัง",
    "Radio62_006" : "ขาดแคลนกายอุปกรณ์/ไม่มีเครื่องช่วยความพิการ",
    "Radio62_007" : "ไม่สามารถช่วยเหลือตัวเองได้ในชีวิตประจำวัน",
    "Radio62_008" : "ไม่ได้รับการรักษาพยาบาลหรือการฟื้นฟูสมรรถภาพ",
    "Radio62_009" : "ติดยาเสพติด",
    "Radio62_010" : "ผู้ป่วยทางจิต",
    "Radio62_011" : "โรคซึมเศร้า",
    "Radio62_012" : "อื่น ๆ ระบุ",


    "Radio63_001": "ขาดโอกาสทางการศึกษา",
    "Radio63_002": "ไม่มีทุนการศึกษา",

    'Radio64_001': 'ขอทาน',
    'Radio64_002': 'ขาดทักษะในการประกอบอาชีพ',
    'Radio64_003': 'ถูกเลิกจ้าง/ว่างงาน', 
    'Radio64_004': 'ถูกนายจ้างเอารัดเอาเปรียบ', 
    'Radio64_005': 'ไม่มีการออม', 
    'Radio64_006': 'ไม่มีงานทำ', 
    'Radio64_007': 'ไม่มีรายได้', 
    'Radio64_008': 'ไม่มีอาชีพ', 
    'Radio64_009': 'ไม่มีที่ดินทำกิน', 
    'Radio64_010': 'รายได้ไม่แน่นอน', 
    'Radio64_011': 'รายได้ไม่พอใช้จ่าย', 
    'Radio64_012': 'มีหนี้สิน', 
    'Radio64_013': 'ไม่มีทุนประกอบอาชีพ', 
    'Radio64_014': 'ยากจน/ไร้ที่พึ่ง',
    'Radio64_015': 'อื่น ๆ ระบุ',

    'Radio65_001': 'กำพร้า', 
    'Radio65_002': 'ครอบครัวแตกแยก/พ่อแม่แยกทาง', 
    'Radio65_003': 'ครอบครัวอุปถัมภ์', 
    'Radio65_004': 'ได้รับการเลี้ยงดูไม่เหมาะสม', 
    'Radio65_005': 'ได้รับผลกระทบจากการที่คนในครอบครัวต้องโทษจำคุก', 
    'Radio65_006': 'ต้องดูแลบุคคลในครอบครัว', 
    'Radio65_007': 'ต้องรับภาระหน้าที่ในครอบครัวเกินวัย/เกินความสามารถสติปัญญา', 
    'Radio65_008': 'ตั้งครรภ์นอกสมรส', 
    'Radio65_009': 'ตั้งครรภ์ในวัยรุ่นและไม่พร้อมในการเลี้ยงดูบุตร', 
    'Radio65_010': 'ถูกทอดทิ้ง', 
    'Radio65_011': 'อยู่ตามลำพังไม่มีผู้ดูแล และมีปัญหาในการดำรงชีวิต', 
    'Radio65_012': 'ผู้ปกครองหรือผู้ดูแลมีพฤติกรรมไม่เหมาะสม', 
    'Radio65_013': 'ผู้ปกครองหรือผู้ดูแลไม่สามารถอุปการะเลี้ยงดูได้', 
    'Radio65_014': 'พ่อม่ายที่ต้องเลี้ยงดูบุตรตามลำพัง/พ่อเลี้ยงเดี่ยว', 
    'Radio65_015': 'แม่ม่ายที่ต้องเลี้ยงดูบุตรตามลำพัง/แม่เลี้ยงเดี่ยว', 
    'Radio65_016': 'ไม่มีผู้ดูแลในตอนกลางวัน ผู้ดูแลต้องออกไปทำงานนอกบ้าน', 
    'Radio65_017': 'ไม่มีผู้ดูแลในตอนกลางคืน ต้องออกไปทำงานนอกบ้าน', 
    'Radio65_018': 'ไม่สามารถเลี้ยงดูบุตรได้', 
    'Radio65_019': 'ถูกกระทำด้วยความรุนแรงในครอบครัว ด้านร่างกาย', 
    'Radio65_020': 'ถูกกระทำด้วยความรุนแรงในครอบครัว ด้านจิตใจ', 
    'Radio65_021': 'ถูกกระทำด้วยความรุนแรงในครอบครัว ด้านเพศ',
    'Radio65_022': 'ครอบครัวมีหนี้สิน', 
    'Radio65_023': 'ครอบครัวมีภาระเลี้ยงดูผู้ประสบปัญหา (อาทิ เด็กคนพิการ ผู้ติดเชื้อเอดส์ ผู้ติดยาเสพติด)',
    'Radio65_024': 'ผู้อุปการะมีฐานะยากจน/ขาดแคลน', 
    'Radio65_025': 'ครอบครัวยากจน',

    'Radio66_001': 'เป็นผู้กระทำความรุนแรงต่อผู้อื่น', 
    'Radio66_002': 'ทารุณกรรมทางร่างกาย', 
    'Radio66_003': 'ทารุณกรรมทางจิตใจ',
    'Radio66_004': 'ทารุณกรรมทางเพศ', 

    'Radio67_001': 'ตกเป็นเครื่องมือแสวงหาผลประโยชน์อื่นๆ',
    'Radio67_002': 'ถูกทารุณกรรม/กักขัง/หน่วงเหนี่ยว',
    'Radio67_003': 'ถูกบังคับขอทาน', 
    'Radio67_004': 'ถูกบังคับค้าประเวณี', 
    'Radio67_005': 'ถูกล่อลวง',
    'Radio67_006': 'ถูกแสวงหาประโยชน์ทางเพศ', 
    'Radio67_007': 'เป็นผู้กระทำความรุนแรงต่อผู้อื่น',
    'Radio67_008': 'ถูกบังคับใช้แรงงาน', 
    'Radio67_009': 'ถูกบังคับให้ประพฤติผิดกฎหมาย',


    'Radio68_001': 'ไม่มีค่าพาหนะเดินทางกลับภูมิลำเนา', 
    'Radio68_002': 'ไม่สามารถเข้าถึงบริการของรัฐ', 
    'Radio68_003': 'ยังไม่ยื่นคำขอมีบัตรประจาตัวคนพิการ', 
    'Radio68_004': 'ไม่มีสถานะทางทะเบียนราษฎร์', 
    'Radio68_005': 'ขอบุตรบุญธรรม', 
    'Radio68_006': 'การเลือกปฏิบัติโดยไม่เป็นธรรมระหว่างเพศ', 
    'Radio68_007': 'ถูกรังเกียจเหยียดหยาม', 
    'Radio68_008': 'เคยต้องโทษ/ประสบปัญหาการใช้ชีวิตในสังคม', 
    'Radio68_009': 'ถูกละเมิดทางเพศ', 
    'Radio68_010': 'ได้รับผลกระทบจากเหตุการณ์ความรุนแรงทางการเมือง', 
    'Radio68_011': 'ได้รับผลกระทบจากเหตุการณ์ความไม่สงบชายแดนภาคใต้', 
    'Radio68_012': 'ได้รับผลกระทบจากภัยพิบัติภัยแล้ง/ภัยหนาว/วาตภัย/อุทกภัย/อัคคีภัย/แผ่นดินไหว',
    'Radio68_013': 'ได้รับผลกระทบจากมลภาวะ/สภาพแวดล้อม',

    'Radio69_001': 'ประพฤติตนไม่เหมาะสม', 
    'Radio69_002': 'เสี่ยงต่อการกระทำผิด', 
    'Radio69_003': 'ไม่ทราบวิธีการปฏิบัติตนหรือการปรับตัวที่เหมาะสม',
    'Radio69_004': 'การอพยพ/หลบหนีเข้าเมือง',
    'Radio69_005': 'อื่น ๆ ระบุ',
}

const seven = {
    '7_1': 'ค่าเลี้ยงดู ค่าพาหนะ สำหรับเด็กที่ประสบปัญหาความเดือดร้อน', 
    '7_2': 'เกี่ยวกับการศึกษาสำหรับเด็กที่ประสบปัญหาความเดือดร้อน', 
    '7_3': 'เงินทุนประกอบอาชีพ  สำหรับครอบครัวของเด็กที่ประสบปัญหาความเดือดร้อน', 
    '7_4': 'ค่ารักษาพยาบาลสำหรับครอบครัวของเด็กที่ประสบปัญหาความเดือดร้อน', 
    '7_5': 'ค่ากายอุปกรณ์แก่เด็กพิการและทุพพลภาพ', 
    '7_6': 'อุปกรณ์ทางการแพทย์ที่ช่วยป้องกันและแก้ไขความพิการของเด็ก', 
    '7_7': 'ค่าใช้จ่ายในการส่งตัวผู้ตกทุกข์ได้ยากในประเทศกลับภูมิลำเนาเดิม', 
    '7_8': 'ค่าอาหารระหว่างรอรับการสงเคราะห์ และระหว่างเดินทางกลับภูมิลำเนาเดิม', 
    '7_9': 'ค่าพาหนะส่งตัวผู้ตกทุกข์ได้ยากในประเทศกลับภูมิลำเนาเดิม', 
    '7_10': 'ค่าเช่าที่พักของผู้ตกทุกข์ได้ยากในประเทศกลับภูมิลำเนาเดิม', 
    '7_11': 'ค่าใช้จ่ายในการรักษาพยาบาล ระหว่างรอรับการสงเคราะห์', 
    '7_12': 'เงินอุดหนุนเพื่อช่วยเหลือผู้ประสบปัญหาทางสังคมกรณีฉุกเฉิน', 
    '7_13': 'ค่าเครื่องอุปโภคบริโภค', 
    '7_14': 'ค่าใช้จ่ายในการครองชีพตามความจำเป็น',
    '7_15': 'ค่ารักษาพยาบาล เช่น ค่ายา ค่าอุปกรณ์การรักษา ค่าอาหารที่โรงพยาบาลหรือสถานพยาบาลของทางราชการสั่งรวมถึงค่าพาหนะ ค่าอาหาร ระหว่างติดต่อรักษาพยาบาล',
    '7_16': 'ค่าซ่อมแซมที่อยู่อาศัย', 
    '7_17': 'เงินทุนประกอบอาชีพ', 
    '7_18': 'เงินทุนประกอบอาชีพ รวมถึงการรวมกลุ่ม', 
    '7_19': 'ค่าอาหาร', 
    '7_20': 'ค่าเครื่องนุ่งห่ม', 
    '7_21': 'ค่าพาหนะเดินทาง ค่าอาหาร ค่าเครื่องนุ่งห่ม หรือค่ารักษาพยาบาลเบื้องต้น แก่ผู้สูงอายุที่ถูกทารุณกรรม หรือถูกแสวงหาประโยชน์โดยมิชอบด้วยกฎหมาย หรือถูกทอดทิ้ง', 
    '7_22': 'เงินทุนประกอบอาชีพแก่สตรีที่ได้รับผลกระทบจากปัญหาเอดส์/ผู้ติดเชื้อเอดส์และครอบครัว',
    '7_23': 'ค่าวัสดุที่พักชั่วคราว', 
    '7_24': 'อื่น ๆ ระบุ',

    'Radio72_001': 'เครื่องอุปโภคและบริโภค', 
    'Radio72_002': 'อุปกรณ์การศึกษา', 
    'Radio72_003': 'อาหาร', 
    'Radio72_004': 'เครื่องนุ่งห่ม', 
    'Radio72_005': 'นมผงสำหรับเด็ก', 
    'Radio72_006': 'ยารักษาโรค', 
    'Radio72_007': 'อื่น ๆ ระบุ',

    'Radio73_001': 'ส่งไปทำกายภาพบำบัด', 
    'Radio73_002': 'ส่งเข้ารับการรักษา/บำบัด', 
    'Radio73_003': 'ติดตามหาญาติ', 
    'Radio73_004': 'เข้ารับบริการในศูนย์บริการผู้สูงอายุ หรืออยู่ในความอุปการะของสถานสงเคราะห์คนชรา หรือสถานที่อื่นที่เหมาะสม',
    'Radio73_005': 'แยกผู้สูงอายุที่ถูกทารุณกรรมไปพักอาศัยในสถานที่อื่นซึ่งมีความปลอดภัย', 
    'Radio73_006': 'นำผู้สูงอายุไปตรวจสุขภาพกาย สุขภาพจิต', 
    'Radio73_007': 'แจ้งความต่อพนักงานสอบสวนเพื่อดำเนินคดีต่อผู้กระทำผิดทารุณกรรม',
    'Radio73_008': 'ให้คำแนะนำแก่ครอบครัว หรือบุคคลที่ผู้สูงอายุอยู่ด้วย เพื่อทำความเข้าใจให้สามารถดูแลผู้สูงอายุมิให้ถูกทารุณกรรมอีก',
    'Radio73_009': 'ให้คำปรึกษาที่เกี่ยวข้องกับคดีและเรื่องสิทธิประโยชน์ของผู้สูงอายุ', 
    'Radio73_010': 'ให้การฟื้นฟูสภาพร่างกาย สภาพจิตใจของผู้สูงอายุ ให้กลับไปสู่สภาวะปกติ และสร้างความสัมพันธ์ระหว่างผู้สูงอายุกับครอบครัว หรือบุคคลที่ผู้สูงอายุอาศัยอยู่ด้วย', 
    'Radio73_011': 'ส่งกลับภูมิลำเนาเดิม', 
    'Radio73_012': 'อื่น ๆ ระบุ',
}

const eight = {
    '8_1': 'เงินสงเคราะห์',
    '8_2': 'เงินทุนประกอบอาชีพ',
    '8_3': 'เบี้ยยังชีพผู้สูงอายุ',
    '8_4':  'เบี้ยความพิการ', 
    '8_5': 'เงินอุดหนุนเพื่อการเลี้ยงดูเด็กแรกเกิด', 
    '8_6': 'สวัสดิการที่ได้จากการลงทะเบียนโครงการเพื่อสวัสดิการแห่งรัฐ',
    '8_7': 'เงินซ่อมแซมบ้าน', 
    '8_8':  'สวัสดิการอื่นจากภาครัฐ', 
    '8_9':  'สวัสดิการภาคเอกชน', 
    '8_10': 'เงินกู้', 
    '8_11': 'เครื่องช่วยความพิการ', 
    '8_12': 'อื่น ๆ',
}


function get_prefix(code) {
    return prefix[code];
}

function get_sub_district(code) {
    let location_pack = JSON.parse(localStorage.getItem('location_pack'));
    let sub_district = location_pack.sub_district;
    for (var key in sub_district) {
        if (sub_district.hasOwnProperty(key)) {
            if (sub_district[key].code == code)
                return sub_district[key].name;
        }
    }
}

function get_district(code) {
    let location_pack = JSON.parse(localStorage.getItem('location_pack'));
    let district = location_pack.district;
    for (var key in district) {
        if (district.hasOwnProperty(key)) {
            if (district[key].code == code)
                return district[key].name;
        }
    }
}

function get_carreer(code) {
    return career[code];
}

function get_education(code) {
    return education[code];
}

function get_relation_case(code) {
    return relation_case[code];
}

function get_religion(code) {
    return religion[code];
}

function get_marital_status(code) {
    return marital_status[code];
}

function get_residence_place(code) {
    return residence_place[code];
}

function get_relation_case(code) {
    return relation_case[code];
}

function get_five(code) {
    return five[code];
}

function get_six(code) {
    return six[code];
}

function get_seven(code) {
    return seven[code];
}

function get_eight(code) {
    return eight[code];
}

function get_birthday_th(date_en) {
        var date = new Date(date_en) 
        var result = date.toLocaleDateString('th-TH', {
            year: 'numeric',
            month: 'long',
            day: 'numeric',
          })
        return result
}



